Revit 2027 API
LinkLoadResult.ElementId Property
 The id of the created or loaded linked model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ElementId { get; }
Public ReadOnly Property ElementId As ElementId
	Get
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
member ElementId : ElementId with get
Property Value
ElementId
Remarks
 This may be invalidElementId if there were errors (for example, LinkLoadResultType.SameModelAsHost causes no link to be created).
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace